### START

### INTRODUCTION TO PANDAS PYTHON LIBRARY

1 pandas is the python library which represents the data in tabular form

2 pandas allows us to import the datasets from the csv or excel or SQL database data source

3 data cleaning involves the filling of missing values and replacing the invalid values 

4 missing value is null value and invalid value is when we get the incorrect data when we check the context

5 pandas have size mutability that means we can easily add or remove the columns and rows

6 we can reshape pivot manupulate extract our dataset as needed and also perform the statistic  analysis

### IMPORTING PANDAS LIBRARY

In [184]:
import pandas as pd

### DATA STRUCTURES IN PANDAS 
data structure is the collection of datatypes that provides the best way to organise the items or values interms of memory usage conbination to There are two types of data struture in pandas and they are series and data frame. 

The series is the one dimensional data struture and data frma eis two dimensional data struture 

The series represent only one column of the dataset and data frame represents entire dataset

SERIES DATASTRUTURE IN PANDAS

1 series represents the one dimensionaal data struture which can only hold one column from the dataset 

2 series will be the values of a particular column infront of which the index of the value is given. index always starts with 0

3 series contains only one column and yoiu can extend the rows as many as you want 

4 series is a homogeneous data struture that means it can only hold one kind of datatype and if we add another data type previous values of the series will be converted to current datatype 

5 datatype of the integer value is integer and object is the data type of string and only these two data types can be there in the series 

6 series is size immutable that means you cannot delete the row in series and if you remove the values then it will create new series with those values and will not change the original series

DATA FRAMES DATA STRUTURE IN PANDAS

1 data frame is two dimensional data struture which contains the rows and columns in it 

2 in data frame you can increase the number of rows and columns as well 

3 it is size mutable which means you can delete update or append the coulmns and rows 

4 its a heterogenous data struture which means you can have multiple data types in single column as well

### CREATING SERIES IN PANDAS
when we create the series using pandas we get the index values and data type of the series as output and we use series function of pandas to create the series data struture

creating array using the list

In [185]:
s1=pd.Series([10,20,30,40,50])
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

### PROPERTIES OF THE SERIES 
There are several properties of the series which can be checked such as data type values name and index of the series as given below 

initially the name of series is none and we can assign the desired name to series and when we access the series after that it will be denoted by that name

In [186]:
print(s1.dtype)
print(s1.values)
print(s1.index)
print(s1.name)
s1.name="calaries"
print(s1.name)
print(s1)

int64
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
None
calaries
0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64

### INDEXING IN SERIES DATA STRUTURE IN PANDAS

indexing in series is same like the python lists or numpy arrays. In series you can see the values at certain index based on range you give the start index and end index where end index is not including

In [187]:
s2=pd.Series([1,2,3,4,5])
print(s2[0])
print(s2[0:3])
print(s2[1:3])

1
0    1
1    2
2    3
dtype: int64
1    2
2    3
dtype: int64

indexing using the iloc function which does indexing based on location of the value so iloc function does the location based indexing which means it will use indexes 0,1,2,3,4 etc

In [188]:
print(s1.iloc[2])
print(s2.iloc[2])

30
3

iloc function is used when you want multiple values which are on different numerical indexes as given below

In [189]:
print(s2.iloc[[2,3]])

2    3
3    4
dtype: int64

### CUSTOM INDEXING IN SERIES

custom indexing is done in series when you dont want palin number as indext of the values and want to put some other data as index so that the series makes more sense.

we create the list and assign the list to series index to perform the custom indexing

custom indexing is done to represent the c=indexes in the more meaningful way so that the coulmn gives important info

In [190]:
print(s1)
idx=['apple','mango','banana','orange','pineapple']
s1.index=idx
print(s1)

0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64
apple        10
mango        20
banana       30
orange       40
pineapple    50
Name: calaries, dtype: int64

finding values of the series using custom indexes

In [191]:
print(s1['apple'])

10

iloc function is used to get the values at the numerical indexes but not for string indexes. For string indexing or custom indexing which is not number you can using loc function as given below 

remember that in label based indexing both start and end index is inclued where as in location based indexing end value is not incliuded

In [192]:
print(s1.loc[['apple','mango']])
print(s1.loc[['apple','mango','pineapple']])

apple    10
mango    20
Name: calaries, dtype: int64
apple        10
mango        20
pineapple    50
Name: calaries, dtype: int64

### CREATING SERIES USING PYTHON DICTIONARY

In [193]:
fruit_protein={
    'apple':0.5,
    'mango':1,
    'banana':1.5,
    'orange':2,
    'seetafal':2.5}
s3=pd.Series(fruit_protein)
s3.name='protein'
print(s3)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [194]:
print(s3.index)
print(s3.dtype)
print(s3.values)
print(s3['seetafal'])
print(s3[['mango','banana','orange']])

Index(['apple', 'mango', 'banana', 'orange', 'seetafal'], dtype='object')
float64
[0.5 1.  1.5 2.  2.5]
2.5
mango     1.0
banana    1.5
orange    2.0
Name: protein, dtype: float64

### CONDTIONAL SELECTION IN SERIES

conditional selection is when you want to find out the data which is satisfying a particular condition you can directly use the condition on the entire series 

when we put a conition on series it returns mask series which can be then used inside the series to get the values

In [195]:
m=s3>1
s3[m]

banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### LOGICAL OPERATORS FOR PANDAS SERIES
logical operators are logical and logical or and logical not which can be used on series as well. We use & for and operator and | for or perator

for logical and we must have both condition true to get true result where as for or operator we need any one condition to be true to the output based on that true condition

In [196]:
mask=s3[(s3>0.5)&(s3<2)]
print(mask)

mango     1.0
banana    1.5
Name: protein, dtype: float64

In [197]:
mask=s3[(s3>0.5) | (s3<2)]
print(mask)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [198]:
print(s3[s3!=1])

apple       0.5
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### MODIFYING THE DATA IN PANDAS SERIES 
The data in the series can also be modified as we do normally for list or numpy arrays using the location or lebel index

In [199]:
s3["mango"]=4
print(s3)

apple       0.5
mango       4.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### DATAFRAME DATA STRUCTURE IN PANDAS

we can convert the dictionary into data frames so that they can be easily be represented properly in the form of table. A dataframe is a two dimensional data struture in pandas where rows and columns both are accepted

In [215]:
data={
    'names':['sagar','rahul','akshay','reshma','divya','ramesh','suresh'],
    'Age':[34,31,33,28,25,54,45],
    'department':['IT','HR','Finance','Admin','marketing','sales','managemnt']
}
empdata=pd.DataFrame(data)
print(empdata)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### ACCESSING TOP AND BOTTOM ITESM OF DATAFRAME
Head and tail functions are used to get the top or bottom values from the data frame

In [201]:
empdata.head(3)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [202]:
empdata.tail(3)

    names  Age department
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### INDEXING IN DATA FRAME 
The iloc and loc functions can be used for indexing in data frame for accessing the different values based on index iloc is used to get values at index and loc is used to fetch the selected coulmns from the entire dataframe 

iloc: gives all the columns of the data frame for specified indexes 

loc: gives the only selected columns within specified range of index

In [203]:
empdata.iloc[0:3]

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [204]:
empdata.loc[0:2,['Age','department']]

   Age department
0   34         IT
1   31         HR
2   33    Finance

### NOTE: 
Always make sure to use the column names as defined in dataframe including the casing whem ujsing iloc function we must pass rows, columns inside it for getting the desired result

also make sure thst your data frame exists so that these operations can be performed without errors

accessing individualcolumns of the data frame 
To access the particular column in the dataframe yoo can use dataframe['column'] and that particular coulmn will show all the rows of the dataframe

In [205]:
empdata['Age']
empdata[['Age','department']]

   Age department
0   34         IT
1   31         HR
2   33    Finance
3   28      Admin
4   25  marketing
5   54      sales
6   45  managemnt

### DROPPING ROWS AND COULMNS IN DATA FRAMES 
To drop the rows and columns of the data frame you can use the drop function with your dataframe name as given below 

axis 0 is used for rows and axis 1 is columns

In [206]:
empdata.drop('Age',axis=1)
print(empdata)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

NOTE : you observe that even after dropping age column it shows up because the inplace parameter is false by default so it does not make changes to dataframe so if you want to drop the column from data frame you must assigne true to inplace parameter as given below

In [207]:
empdata.drop('Age',axis=1,inplace=True)
print(empdata)

    names department
0   sagar         IT
1   rahul         HR
2  akshay    Finance
3  reshma      Admin
4   divya  marketing
5  ramesh      sales
6  suresh  managemnt

DROPPING ROWS OR SAMPLES FROM THE DATA FRAME

In [208]:
empdata
empdata.drop(1,axis=0,inplace=True)
empdata

    names department
0   sagar         IT
2  akshay    Finance
3  reshma      Admin
4   divya  marketing
5  ramesh      sales
6  suresh  managemnt

### ADDING ROWS AND COLUMNS TO DATAFRAME

Adding columns to the existing data frame

In [219]:
empdata['salary']=[10000,20000,30000,40000,50000,60000,70000]

Adding rows to exiting dataframe you can add it at the end of the data frame using loc function and you can add at top using another dataframe and concat function

adding rows at end of the dataframe using dictionary and loc function as given below

In [ ]:
nr={
    "names":"sagar",
    "department":"IT",
    "salary":90000
}
empdata.loc[len(empdata)]=nr
print(empdata)

     names department  salary
1    arjun  marketing  200000
2    sagar         IT   90000
3    arjun  marketing  200000
4    sagar         IT   90000
5    arjun  marketing  200000
6    sagar         IT   90000
7    arjun  marketing  200000
8   akshay    Finance   30000
9   reshma      Admin   40000
10   divya  marketing   50000
11  ramesh      sales   60000
12   sagar         IT   90000
0    sagar         IT   90000
13   sagar         IT   90000

adding rows at the begining 

when you are adding rows at the begining you can create one dataframe with all new samples and than ypu can contact it with exisitng dataframe to get the result

In [ ]:
nr=pd.DataFrame({
    "names":["sagar",'arjun'],
    "department":["IT",'marketing'],
    "salary":[90000,200000]
})
empdata=pd.concat([nr,empdata],ignore_index=True)
print(empdata)

     names department  salary
0    sagar         IT   90000
1    arjun  marketing  200000
2    sagar         IT   90000
3    arjun  marketing  200000
4    sagar         IT   90000
5    arjun  marketing  200000
6    sagar         IT   90000
7    arjun  marketing  200000
8   akshay    Finance   30000
9   reshma      Admin   40000
10   divya  marketing   50000
11  ramesh      sales   60000
12   sagar         IT   90000

In [ ]:
data={
    'names':['sagar','rahul','akshay','reshma','divya','ramesh','suresh'],
    'Age':[34,31,33,28,25,54,45],
    'department':['IT','HR','Finance','Admin','marketing','sales','managemnt']
}
empdata2=pd.DataFrame(data)
print(empdata2)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### FUNCTIONS USED ON DATAFRMAE 
there are many functions which can be used on the data frame for getting information and structure of data frame as given below

shape function gives the number of rows and coulmns in dataframe

In [ ]:
print(empdata)
print(empdata2)
print(empdata.shape)
print(empdata2.shape)

    names department
0   sagar         IT
1   rahul         HR
2  akshay    Finance
3  reshma      Admin
4   divya  marketing
5  ramesh      sales
6  suresh  managemnt
    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt
(7, 2)
(7, 3)

NOTE : indexes atre not included as the columns they are there by default and each row is called as sample when we atre dealing with dataframe and each column is called as feature in data frame

dataype function : we can use the dtype function in data frame to get the data types of the data frame

In [ ]:
print(empdata.dtypes)
print(empdata2.dtypes)

names         object
department    object
dtype: object
names         object
Age            int64
department    object
dtype: object

Info function : this is used to get other information about our data frame such as its class total samples and features their data types and non null values and null values

In [ ]:
empdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       7 non-null      object
 1   department  7 non-null      object
dtypes: object(2)
memory usage: 244.0+ bytes

In [ ]:
empdata2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       7 non-null      object
 1   Age         7 non-null      int64
 2   department  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

describe function: describe function is used on the data frame to get the statistical information related to that data frame as given below

In [ ]:
empdata2.describe()

             Age
count   7.000000
mean   35.714286
std    10.226017
min    25.000000
25%    29.500000
50%    33.000000
75%    39.500000
max    54.000000

In [ ]:
empdata.describe()

              salary        Age
count       6.000000   6.000000
mean    78333.333333  31.666667
std     63060.817206   7.659417
min     30000.000000  23.000000
25%     42500.000000  27.000000
50%     55000.000000  31.000000
75%     82500.000000  33.500000
max    200000.000000  45.000000

### RESETTING INDEX OF DATAFRAME 

when index is messed up for your data frame after you add or drop the columns or rows you can reset it using reset_index function put drop to true

In [ ]:

empdata["Age"]=[34,45,23,32,30,26]
empdata.reset_index(drop=True,inplace=True)
print(empdata)

    names department  salary  Age
0   sagar         IT   90000   34
1   arjun  marketing  200000   45
2  akshay    Finance   30000   23
3  reshma      Admin   40000   32
4   divya  marketing   50000   30
5  ramesh      sales   60000   26

### BROADCASTING IN DATA FRAMES
When the scaler value is stretched to match the shape of the column array then its called as broadcasting

In [ ]:
empdata['salary']
empdata['salary']+=5000
print(empdata)

    names department  salary  Age
0   sagar         IT   95000   34
1   arjun  marketing  205000   45
2  akshay    Finance   35000   23
3  reshma      Admin   45000   32
4   divya  marketing   55000   30
5  ramesh      sales   65000   26

### RENAMING THE COLUMNS IN DATAFRAME 
The columns of the data frame can be renamed using the renmae function as given below:

In [ ]:
empdata.rename(columns={'names':'Name'},inplace=True)
empdata.rename(columns={'department':'Department'},inplace=True)
empdata.rename(columns={'salary':'Salary'},inplace=True)
print(empdata)

     Name Department  Salary  Age
0   sagar         IT   95000   34
1   arjun  marketing  205000   45
2  akshay    Finance   35000   23
3  reshma      Admin   45000   32
4   divya  marketing   55000   30
5  ramesh      sales   65000   26

### SOME IMPORTANT COLUMN FUNCTIONS

UNIQUE FUNCTION: 

finding the unique values in column of dataframe using unique() function always remember that the names of columns and data is case sensitive

In [ ]:
print(empdata['Name'].unique())

['sagar' 'arjun' 'akshay' 'reshma' 'divya' 'ramesh']

COUNT AND VALUE_COUNT FUNCTION:

you can also count of total number of the values of the column and value count gives the count of repeating values within that column as well as given below

In [ ]:
empdata['Department'].value_counts()

Department
marketing    2
IT           1
Finance      1
Admin        1
sales        1
Name: count, dtype: int64

ADDING COLUMNS TO DATA FRAME

In [222]:
empdata['Promoted Salary']=empdata['salary']*10
print(empdata)

    names  Age department  salary  Promoted Salary
0   sagar   34         IT   10000           100000
1   rahul   31         HR   20000           200000
2  akshay   33    Finance   30000           300000
3  reshma   28      Admin   40000           400000
4   divya   25  marketing   50000           500000
5  ramesh   54      sales   60000           600000
6  suresh   45  managemnt   70000           700000

ADDING ROWS TO DATA FRAME 
rows can be added to data frame using the concat method make sure that the datafrmae which you create must have list as values not the single or scaler value

In [ ]:
import numpy as np
nr=pd.DataFrame(
    {
        "Name":['alok'],
        'Department':['admin'],
        'Salary':[np.nan],
        'Age':[65],
        'Promoted Salary':[np.nan]
    }
)
empdata=pd.concat([empdata,nr],ignore_index=True)
print(empdata)

       Name Department    Salary  Age  Promoted Salary
0  abhishek         IT   95000.0   34         100000.0
1     arjun  marketing  205000.0   45         210000.0
2    akshay    Finance   35000.0   23          40000.0
3    reshma      Admin   45000.0   32          50000.0
4     divya  marketing   55000.0   30          60000.0
5    ramesh      sales   65000.0   26          70000.0
6      alok      admin   60000.0   65          60000.0
7      alok      admin       NaN   65              NaN
8      alok      admin       NaN   65              NaN

### CHECKING AND DEALING WITH NULL VALUES IN DATAFRAMES:

you can check where the null values are present in your dataframe as given below where we check null values and sum them as per column

In [ ]:
empdata.isnull().sum()

Name               0
Department         0
Salary             1
Age                0
Promoted Salary    1
dtype: int64

DROPNA function : na stands for null values

dropna function is used when you want to get rid of the samples which contains the null values and it will reflect it in dataframe if you give inpalce=true while calling dropna() as given below

there is how parameter of the dropna function which can take any or all as arguments 

all--- removes the sample only if all values are null 
any--- if any column of the sample is null it will remove the sample

In [ ]:
empdata.dropna(how='all')

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         950000.0
1   arjun  marketing  205000.0   45        2050000.0
2  akshay    Finance   35000.0   23         350000.0
3  reshma      Admin   45000.0   32         450000.0
4   divya  marketing   55000.0   30         550000.0
5  ramesh      sales   65000.0   26         650000.0
6    alok      admin       NaN   65              NaN

In [ ]:
empdata.dropna(how='any')

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         950000.0
1   arjun  marketing  205000.0   45        2050000.0
2  akshay    Finance   35000.0   23         350000.0
3  reshma      Admin   45000.0   32         450000.0
4   divya  marketing   55000.0   30         550000.0
5  ramesh      sales   65000.0   26         650000.0

FILLING THE NULL VALUES

The missing values or the null values can be delt in two ways either we can drop them using dropna function or we can fill them using fillna function

In [ ]:
empdata.fillna(0)

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         950000.0
1   arjun  marketing  205000.0   45        2050000.0
2  akshay    Finance   35000.0   23         350000.0
3  reshma      Admin   45000.0   32         450000.0
4   divya  marketing   55000.0   30         550000.0
5  ramesh      sales   65000.0   26         650000.0
6    alok      admin       0.0   65              0.0

NOTE: you can replace the null values with 0 but thats not hwo we deal with missing data and we msut fill it with more meaningful data

In [ ]:
empdata
empdata.fillna(empdata['Salary'].median(),inplace=True)

In [ ]:
empdata

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         100000.0
1   arjun  marketing  205000.0   45         210000.0
2  akshay    Finance   35000.0   23          40000.0
3  reshma      Admin   45000.0   32          50000.0
4   divya  marketing   55000.0   30          60000.0
5  ramesh      sales   65000.0   26          70000.0
6    alok      admin   60000.0   65          60000.0

In [ ]:
empdata.fillna(empdata['Promoted Salary'].median(),inplace=True)
empdata

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         100000.0
1   arjun  marketing  205000.0   45         210000.0
2  akshay    Finance   35000.0   23          40000.0
3  reshma      Admin   45000.0   32          50000.0
4   divya  marketing   55000.0   30          60000.0
5  ramesh      sales   65000.0   26          70000.0
6    alok      admin   60000.0   65          60000.0

FORWARD AND BACKWORD FILLS FOR MISSING VALUES

if we move from top to bottom in the column of the dataframe and there is missing value if we do forward fill the missing value is replaced by the value above it 

if we use backward ifll the value after the missing value is filled in the missing value

FORWARD FILL:

In [ ]:
empdata['Salary'].fillna(method='ffill')
empdata['Salary'].fillna(method='bfill')

C:\Users\3525\AppData\Local\Temp\ipykernel_19448\3812033502.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  empdata['Salary'].fillna(method='ffill')
C:\Users\3525\AppData\Local\Temp\ipykernel_19448\3812033502.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  empdata['Salary'].fillna(method='bfill')

     Name Department    Salary  Age  Promoted Salary
0   sagar         IT   95000.0   34         100000.0
1   arjun  marketing  205000.0   45         210000.0
2  akshay    Finance   35000.0   23          40000.0
3  reshma      Admin   45000.0   32          50000.0
4   divya  marketing   55000.0   30          60000.0
5  ramesh      sales   65000.0   26          70000.0
6    alok      admin   60000.0   65          60000.0
7    alok      admin       NaN   65              NaN

### REPLACING THE EXISTING VALUE WITH NEW ONE IN DATAFRAME

for replacing any values in the column you cqan use the replace method for dataframe as given below a

In [ ]:

empdata['Name'].replace('sagar','abhishek',inplace=True)
empdata

       Name Department    Salary  Age  Promoted Salary
0  abhishek         IT   95000.0   34         100000.0
1     arjun  marketing  205000.0   45         210000.0
2    akshay    Finance   35000.0   23          40000.0
3    reshma      Admin   45000.0   32          50000.0
4     divya  marketing   55000.0   30          60000.0
5    ramesh      sales   65000.0   26          70000.0
6      alok      admin   60000.0   65          60000.0
7      alok      admin       NaN   65              NaN

### DEALING WITH DUPLICATE DATA IN DATAFRAME

CHECKING FOR DUPLICATE VALUES:

The sample is only categorized as duplicate if and only if all the features of that sample are same with another sample 

There is a keep parameter for duplicated function which can take first and last as argument which means it will not mark first element as duplicate and when we give last it will not mark last element as duplicate

In [ ]:
dup=empdata[empdata.duplicated(keep='first')]
dup=empdata[empdata.duplicated(keep='last')]
dup

   Name Department  Salary  Age  Promoted Salary
7  alok      admin     NaN   65              NaN

Dropping duplicate samples

In [ ]:
empdata.drop_duplicates()

       Name Department    Salary  Age  Promoted Salary
0  abhishek         IT   95000.0   34         100000.0
1     arjun  marketing  205000.0   45         210000.0
2    akshay    Finance   35000.0   23          40000.0
3    reshma      Admin   45000.0   32          50000.0
4     divya  marketing   55000.0   30          60000.0
5    ramesh      sales   65000.0   26          70000.0
6      alok      admin   60000.0   65          60000.0
7      alok      admin       NaN   65              NaN

### DEALING WITH INVALID VALUES IN DATAFRAME

we can deal with the invalid values which are the values not possible for that column data representation using the lamda fucntion and apply function

In [226]:
empdata['Promoted Salary']=empdata['Promoted Salary'].apply(lambda x :x/10 if x>100000 else x)
empdata

    names  Age department  salary  Promoted Salary
0   sagar   34         IT   10000          10000.0
1   rahul   31         HR   20000           2000.0
2  akshay   33    Finance   30000           3000.0
3  reshma   28      Admin   40000           4000.0
4   divya   25  marketing   50000           5000.0
5  ramesh   54      sales   60000           6000.0
6  suresh   45  managemnt   70000           7000.0

In [229]:
empdata['names'].replace('sagar','rakesh',inplace=True)
empdata

    names  Age department  salary  Promoted Salary
0  rakesh   34         IT   10000          10000.0
1   rahul   31         HR   20000           2000.0
2  akshay   33    Finance   30000           3000.0
3  reshma   28      Admin   40000           4000.0
4   divya   25  marketing   50000           5000.0
5  ramesh   54      sales   60000           6000.0
6  suresh   45  managemnt   70000           7000.0

In [232]:
empdata['Age']=empdata['Age'].apply(lambda X: X/2)
empdata

    names    Age department  salary  Promoted Salary
0  rakesh   68.0         IT   10000          10000.0
1   rahul   62.0         HR   20000           2000.0
2  akshay   66.0    Finance   30000           3000.0
3  reshma   56.0      Admin   40000           4000.0
4   divya   50.0  marketing   50000           5000.0
5  ramesh  108.0      sales   60000           6000.0
6  suresh   90.0  managemnt   70000           7000.0

### JOINS AND MERGES IN DATAFRAME
Joins can be inner and outer join and outer joins can be left outer joins or right outer join

merge : when we merge the two datsets all things which are available in dataset a and dataset b will be combined

In [235]:
dept_info={
    'Department':['HR','IT','Finance'],
    'location':['delhi','mumbai','bangalore'],
    'manager':['himesh','mukesh','hari']
}
dinfo=pd.DataFrame(dept_info)
dinfo

  Department   location manager
0         HR      delhi  himesh
1         IT     mumbai  mukesh
2    Finance  bangalore    hari